pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EMB0</name>
            <description>desc EMB</description>
            <groupName>EMB</groupName>
            <baseAddress>0x40038600</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR0</name>
                <description>EMB Group0 interrupt</description>
                <value>83</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL1</name>
                    <description>desc CTL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFDF07F7</resetMask>
                    <fields>
                        <field>
                            <name>CMPEN1</name>
                            <description>desc CMPEN1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPEN2</name>
                            <description>desc CMPEN2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPEN3</name>
                            <description>desc CMPEN3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSEN</name>
                            <description>desc SYSEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN0</name>
                            <description>desc PWMSEN0</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN1</name>
                            <description>desc PWMSEN1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN2</name>
                            <description>desc PWMSEN2</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN3</name>
                            <description>desc PWMSEN3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN4</name>
                            <description>desc PWMSEN4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN5</name>
                            <description>desc PWMSEN5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN1</name>
                            <description>desc PORTINEN1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN2</name>
                            <description>desc PORTINEN2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN3</name>
                            <description>desc PORTINEN3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN4</name>
                            <description>desc PORTINEN4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN5</name>
                            <description>desc PORTINEN5</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL1</name>
                            <description>desc INVSEL1</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL2</name>
                            <description>desc INVSEL2</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL3</name>
                            <description>desc INVSEL3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL4</name>
                            <description>desc INVSEL4</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL5</name>
                            <description>desc INVSEL5</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSCSTPEN</name>
                            <description>desc OSCSTPEN</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMECCERREN</name>
                            <description>desc SRAMECCERREN</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPYERREN</name>
                            <description>desc RAMPYERREN</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOCKUPEN</name>
                            <description>desc LOCKUPEN</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>desc PVDEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL2</name>
                    <description>desc CTL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFC3F</resetMask>
                    <fields>
                        <field>
                            <name>PWMLV0</name>
                            <description>desc PWMLV0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV1</name>
                            <description>desc PWMLV1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV2</name>
                            <description>desc PWMLV2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV3</name>
                            <description>desc PWMLV3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV4</name>
                            <description>desc PWMLV4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV5</name>
                            <description>desc PWMLV5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL1_2</name>
                            <description>desc NFSEL1_2</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL2_2</name>
                            <description>desc NFSEL2_2</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL3_2</name>
                            <description>desc NFSEL3_2</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL4_2</name>
                            <description>desc NFSEL4_2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL5_2</name>
                            <description>desc NFSEL5_2</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFMD</name>
                            <description>desc NFMD</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL1</name>
                            <description>desc NFSEL1</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN1</name>
                            <description>desc NFEN1</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL2</name>
                            <description>desc NFSEL2</description>
                            <msb>20</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN2</name>
                            <description>desc NFEN2</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL3</name>
                            <description>desc NFSEL3</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN3</name>
                            <description>desc NFEN3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL4</name>
                            <description>desc NFSEL4</description>
                            <msb>26</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN4</name>
                            <description>desc NFEN4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL5</name>
                            <description>desc NFSEL5</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN5</name>
                            <description>desc NFEN5</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOE</name>
                    <description>desc SOE</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>SOE</name>
                            <description>desc SOE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
