pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
                <register>
                    <name>HCLRR2</name>
                    <description>desc HCLRR2</description>
                    <addressOffset>0x218</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCLREXEV1</name>
                            <description>desc HCLREXEV1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV2</name>
                            <description>desc HCLREXEV2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV3</name>
                            <description>desc HCLREXEV3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV4</name>
                            <description>desc HCLREXEV4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV5</name>
                            <description>desc HCLREXEV5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV6</name>
                            <description>desc HCLREXEV6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV7</name>
                            <description>desc HCLREXEV7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV8</name>
                            <description>desc HCLREXEV8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV9</name>
                            <description>desc HCLREXEV9</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLREXEV10</name>
                            <description>desc HCLREXEV10</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA1</name>
                            <description>desc HCLRGCMA1</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB1</name>
                            <description>desc HCLRGCMB1</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA2</name>
                            <description>desc HCLRGCMA2</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB2</name>
                            <description>desc HCLRGCMB2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA3</name>
                            <description>desc HCLRGCMA3</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB3</name>
                            <description>desc HCLRGCMB3</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA4</name>
                            <description>desc HCLRGCMA4</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB4</name>
                            <description>desc HCLRGCMB4</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA5</name>
                            <description>desc HCLRGCMA5</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB5</name>
                            <description>desc HCLRGCMB5</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMA6</name>
                            <description>desc HCLRGCMA6</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRGCMB6</name>
                            <description>desc HCLRGCMB6</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB1</name>
                            <description>desc HCLRSCMB1</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB2</name>
                            <description>desc HCLRSCMB2</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB3</name>
                            <description>desc HCLRSCMB3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB4</name>
                            <description>desc HCLRSCMB4</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB5</name>
                            <description>desc HCLRSCMB5</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLRSCMB6</name>
                            <description>desc HCLRSCMB6</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EEFOFFSETAR</name>
                    <description>desc EEFOFFSETAR</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x400000</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OFFSET</name>
                            <description>desc OFFSET</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETDIR</name>
                            <description>desc OFFSETDIR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EEFOFFSETBR</name>
                    <description>desc EEFOFFSETBR</description>
                    <addressOffset>0x224</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x400000</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OFFSET</name>
                            <description>desc OFFSET</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETDIR</name>
                            <description>desc OFFSETDIR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EEFWINAR</name>
                    <description>desc EEFWINAR</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x400000</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WIN</name>
                            <description>desc WIN</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WINDIR</name>
                            <description>desc WINDIR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EEFWINBR</name>
                    <description>desc EEFWINBR</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x400000</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WIN</name>
                            <description>desc WIN</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WINDIR</name>
                            <description>desc WINDIR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EEFLTCR1</name>
                    <description>desc EEFLTCR1</description>
                    <addressOffset>0x230</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EE1LAT</name>
                            <description>desc EE1LAT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE1FM</name>
                            <description>desc EE1FM</description>
                            <msb>4</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE1TMO</name>
                            <description>desc EE1TMO</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE2LAT</name>
                            <description>desc EE2LAT</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE2FM</name>
                            <description>desc EE2FM</description>
                            <msb>10</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE2TMO</name>
                            <description>desc EE2TMO</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE3LAT</name>
                            <description>desc EE3LAT</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE3FM</name>
                            <description>desc EE3FM</description>
                            <msb>16</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE3TMO</name>
                            <description>desc EE3TMO</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE4LAT</name>
                            <description>desc EE4LAT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE4FM</name>
                            <description>desc EE4FM</description>
                            <msb>22</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE4TMO</name>
                            <description>desc EE4TMO</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE5LAT</name>
                            <description>desc EE5LAT</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE5FM</name>
                            <description>desc EE5FM</description>
                            <msb>28</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE5TMO</name>
                            <description>desc EE5TMO</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEINTPOL</name>
                            <description>desc EEINTPOL</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
