pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
                <register>
                    <name>BPCNAR2</name>
                    <description>desc BPCNAR2</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCA</name>
                            <description>desc EXEV1UCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCA</name>
                            <description>desc EXEV2UCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCA</name>
                            <description>desc EXEV3UCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCA</name>
                            <description>desc EXEV4UCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCA</name>
                            <description>desc EXEV5UCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCA</name>
                            <description>desc EXEV6UCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCA</name>
                            <description>desc EXEV7UCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCA</name>
                            <description>desc EXEV8UCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCA</name>
                            <description>desc EXEV9UCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCA</name>
                            <description>desc EXEV10UCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCA</name>
                            <description>desc CMEUCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCA</name>
                            <description>desc CMFUCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCA</name>
                            <description>desc SCMAUCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCA</name>
                            <description>desc SCMBUCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNBR2</name>
                    <description>desc BPCNBR2</description>
                    <addressOffset>0x258</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1UCB</name>
                            <description>desc EXEV1UCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2UCB</name>
                            <description>desc EXEV2UCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3UCB</name>
                            <description>desc EXEV3UCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4UCB</name>
                            <description>desc EXEV4UCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5UCB</name>
                            <description>desc EXEV5UCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6UCB</name>
                            <description>desc EXEV6UCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7UCB</name>
                            <description>desc EXEV7UCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8UCB</name>
                            <description>desc EXEV8UCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9UCB</name>
                            <description>desc EXEV9UCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10UCB</name>
                            <description>desc EXEV10UCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEUCB</name>
                            <description>desc CMEUCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFUCB</name>
                            <description>desc CMFUCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMAUCB</name>
                            <description>desc SCMAUCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBUCB</name>
                            <description>desc SCMBUCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNAR3</name>
                    <description>desc BPCNAR3</description>
                    <addressOffset>0x25C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCA</name>
                            <description>desc EXEV1DCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCA</name>
                            <description>desc EXEV2DCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCA</name>
                            <description>desc EXEV3DCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCA</name>
                            <description>desc EXEV4DCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCA</name>
                            <description>desc EXEV5DCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCA</name>
                            <description>desc EXEV6DCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCA</name>
                            <description>desc EXEV7DCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCA</name>
                            <description>desc EXEV8DCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCA</name>
                            <description>desc EXEV9DCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCA</name>
                            <description>desc EXEV10DCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCA</name>
                            <description>desc CMEDCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCA</name>
                            <description>desc CMFDCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCA</name>
                            <description>desc SCMADCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCA</name>
                            <description>desc SCMBDCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCNBR3</name>
                    <description>desc BPCNBR3</description>
                    <addressOffset>0x260</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCB</name>
                            <description>desc EXEV1DCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCB</name>
                            <description>desc EXEV2DCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCB</name>
                            <description>desc EXEV3DCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCB</name>
                            <description>desc EXEV4DCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCB</name>
                            <description>desc EXEV5DCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCB</name>
                            <description>desc EXEV6DCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCB</name>
                            <description>desc EXEV7DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCB</name>
                            <description>desc EXEV8DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCB</name>
                            <description>desc EXEV9DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCB</name>
                            <description>desc EXEV10DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCB</name>
                            <description>desc CMEDCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCB</name>
                            <description>desc CMFDCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCB</name>
                            <description>desc SCMADCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCB</name>
                            <description>desc SCMBDCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
