pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
                <register>
                    <name>SSTARUNR2</name>
                    <description>desc SSTARUNR2</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTARUN1A2</name>
                            <description>desc SSTARUN1A2</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN1B2</name>
                            <description>desc SSTARUN1B2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN2A2</name>
                            <description>desc SSTARUN2A2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN2B2</name>
                            <description>desc SSTARUN2B2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN3A2</name>
                            <description>desc SSTARUN3A2</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN3B2</name>
                            <description>desc SSTARUN3B2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN4A2</name>
                            <description>desc SSTARUN4A2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN4B2</name>
                            <description>desc SSTARUN4B2</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN5A2</name>
                            <description>desc SSTARUN5A2</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN5B2</name>
                            <description>desc SSTARUN5B2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN6A2</name>
                            <description>desc SSTARUN6A2</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTARUN6B2</name>
                            <description>desc SSTARUN6B2</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTADIDLR</name>
                    <description>desc SSTADIDLR</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>DLYSTRGU1</name>
                            <description>desc DLYSTRGU1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLYSTRGU2</name>
                            <description>desc DLYSTRGU2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLYSTRGU3</name>
                            <description>desc DLYSTRGU3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLYSTRGU4</name>
                            <description>desc DLYSTRGU4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLYSTRGU5</name>
                            <description>desc DLYSTRGU5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLYSTRGU6</name>
                            <description>desc DLYSTRGU6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCTLR</name>
                    <description>desc GCTLR</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>EE1SRC2</name>
                            <description>desc EE1SRC2</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE2SRC2</name>
                            <description>desc EE2SRC2</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY1</name>
                            <description>desc BKDLY1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY2</name>
                            <description>desc BKDLY2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY3</name>
                            <description>desc BKDLY3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY4</name>
                            <description>desc BKDLY4</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY5</name>
                            <description>desc BKDLY5</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKDLY6</name>
                            <description>desc BKDLY6</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE3SRC2</name>
                            <description>desc EE3SRC2</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE4SRC2</name>
                            <description>desc EE4SRC2</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE5SRC2</name>
                            <description>desc EE5SRC2</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE6SRC2</name>
                            <description>desc EE6SRC2</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE7SRC2</name>
                            <description>desc EE7SRC2</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE8SRC2</name>
                            <description>desc EE8SRC2</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE9SRC2</name>
                            <description>desc EE9SRC2</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE10SRC2</name>
                            <description>desc EE10SRC2</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBCONR</name>
                    <description>desc GBCONR</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3F</resetValue>
                    <resetMask>0xC0003F3F</resetMask>
                    <fields>
                        <field>
                            <name>BTRU1EN</name>
                            <description>desc BTRU1EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU2EN</name>
                            <description>desc BTRU2EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU3EN</name>
                            <description>desc BTRU3EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU4EN</name>
                            <description>desc BTRU4EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU5EN</name>
                            <description>desc BTRU5EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU6EN</name>
                            <description>desc BTRU6EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU1SFT</name>
                            <description>desc BTRU1SFT</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU2SFT</name>
                            <description>desc BTRU2SFT</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU3SFT</name>
                            <description>desc BTRU3SFT</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU4SFT</name>
                            <description>desc BTRU4SFT</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU5SFT</name>
                            <description>desc BTRU5SFT</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRU6SFT</name>
                            <description>desc BTRU6SFT</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSTBTRU1</name>
                            <description>desc OSTBTRU1</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OSTENU1</name>
                            <description>desc OSTENU1</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBSFLR</name>
                    <description>desc GBSFLR</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>U1BTRENF</name>
                            <description>desc U1BTRENF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U2BTRENF</name>
                            <description>desc U2BTRENF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U3BTRENF</name>
                            <description>desc U3BTRENF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U4BTRENF</name>
                            <description>desc U4BTRENF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U5BTRENF</name>
                            <description>desc U5BTRENF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>U6BTRENF</name>
                            <description>desc U6BTRENF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
