pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x5000000</resetValue>
                    <resetMask>0xBFF756DF</resetMask>
                    <fields>
                        <field>
                            <name>STARTF</name>
                            <description>desc STARTF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLADDR0F</name>
                            <description>desc SLADDR0F</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLADDR1F</name>
                            <description>desc SLADDR1F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TENDF</name>
                            <description>desc TENDF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STOPF</name>
                            <description>desc STOPF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFULLF</name>
                            <description>desc RFULLF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEMPTYF</name>
                            <description>desc TEMPTYF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARLOF</name>
                            <description>desc ARLOF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACKRF</name>
                            <description>desc ACKRF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NACKF</name>
                            <description>desc NACKF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMOUTF</name>
                            <description>desc TMOUTF</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSL</name>
                            <description>desc MSL</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>desc BUSY</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRA</name>
                            <description>desc TRA</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GENCALLF</name>
                            <description>desc GENCALLF</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTF</name>
                            <description>desc SMBDEFAULTF</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBHOSTF</name>
                            <description>desc SMBHOSTF</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBALRTF</name>
                            <description>desc SMBALRTF</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFEMPTY</name>
                            <description>desc TFEMPTY</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFFULL</name>
                            <description>desc TFFULL</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFEMPTY</name>
                            <description>desc RFEMPTY</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFFULL</name>
                            <description>desc RFFULL</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFST</name>
                            <description>desc TFST</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFREQ</name>
                            <description>desc RFREQ</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLR</name>
                    <description>desc CLR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0565F</resetMask>
                    <fields>
                        <field>
                            <name>STARTFCLR</name>
                            <description>desc STARTFCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SLADDR0FCLR</name>
                            <description>desc SLADDR0FCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SLADDR1FCLR</name>
                            <description>desc SLADDR1FCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TENDFCLR</name>
                            <description>desc TENDFCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>STOPFCLR</name>
                            <description>desc STOPFCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RFULLFCLR</name>
                            <description>desc RFULLFCLR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ARLOFCLR</name>
                            <description>desc ARLOFCLR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RFREQCLR</name>
                            <description>desc RFREQCLR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>NACKFCLR</name>
                            <description>desc NACKFCLR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TMOUTFCLR</name>
                            <description>desc TMOUTFCLR</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>GENCALLFCLR</name>
                            <description>desc GENCALLFCLR</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTFCLR</name>
                            <description>desc SMBDEFAULTFCLR</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SMBHOSTFCLR</name>
                            <description>desc SMBHOSTFCLR</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SMBALRTFCLR</name>
                            <description>desc SMBALRTFCLR</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTR</name>
                    <description>desc DTR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>DRR</name>
                    <description>desc DRR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CCR</name>
                    <description>desc CCR</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1F1F</resetValue>
                    <resetMask>0x87FFFF</resetMask>
                    <fields>
                        <field>
                            <name>SLOWW</name>
                            <description>desc SLOWW</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIGHW</name>
                            <description>desc SHIGHW</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>desc CKDIV</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMPLUSEN</name>
                            <description>desc FMPLUSEN</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLTR</name>
                    <description>desc FLTR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0x33</resetMask>
                    <fields>
                        <field>
                            <name>DNF</name>
                            <description>desc DNF</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNFEN</name>
                            <description>desc DNFEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ANFEN</name>
                            <description>desc ANFEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSTR</name>
                    <description>desc FSTR</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FEN</name>
                            <description>desc FEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TFFLUSH</name>
                            <description>desc TFFLUSH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFFLUSH</name>
                            <description>desc RFFLUSH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NACKTFFLUSH</name>
                            <description>desc NACKTFFLUSH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TFST</name>
                            <description>desc TFST</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFST</name>
                            <description>desc RFST</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLVADDR</name>
                    <description>desc SLVADDR</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF</resetMask>
                    <fields>
                        <field>
                            <name>SLVADRR</name>
                            <description>desc SLVADRR</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
