pyocd/pyOCD/pyocd/debug/svd/data/HC32F336.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TMR61</name>
            <description>desc TMR6</description>
            <groupName>TMR6</groupName>
            <baseAddress>0x40039000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_1_GCMP</name>
                <description>Timer6 unit 1 compare matched interrupt</description>
                <value>50</value>
            </interrupt>
            <interrupt>
                <name>TMR6_1_OVF_UDF</name>
                <description>Timer6 unit 1 overflow or underflow interrupt</description>
                <value>51</value>
            </interrupt>
            <interrupt>
                <name>TMR6_1_DTE</name>
                <description>Timer6 unit 1 dead time error interrupt</description>
                <value>52</value>
            </interrupt>
            <interrupt>
                <name>TMR6_1_SCMP</name>
                <description>Timer6 unit 1 special compare matched interrupt</description>
                <value>53</value>
            </interrupt>
            <registers>
                <register>
                    <name>CNTER</name>
                    <description>desc CNTER</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>UPDAR</name>
                    <description>desc UPDAR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PERAR</name>
                    <description>desc PERAR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PERBR</name>
                    <description>desc PERBR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PERCR</name>
                    <description>desc PERCR</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMAR</name>
                    <description>desc GCMAR</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMBR</name>
                    <description>desc GCMBR</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMCR</name>
                    <description>desc GCMCR</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMDR</name>
                    <description>desc GCMDR</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMER</name>
                    <description>desc GCMER</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCMFR</name>
                    <description>desc GCMFR</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMAR</name>
                    <description>desc SCMAR</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMBR</name>
                    <description>desc SCMBR</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMCR</name>
                    <description>desc SCMCR</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMDR</name>
                    <description>desc SCMDR</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMER</name>
                    <description>desc SCMER</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCMFR</name>
                    <description>desc SCMFR</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DTUAR</name>
                    <description>desc DTUAR</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DTDAR</name>
                    <description>desc DTDAR</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DTUBR</name>
                    <description>desc DTUBR</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DTDBR</name>
                    <description>desc DTDBR</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>GCONR</name>
                    <description>desc GCONR</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xF01F7</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>desc DIR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>desc CKDIV</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSTP</name>
                            <description>desc OVSTP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZMSKREV</name>
                            <description>desc ZMSKREV</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZMSKPOS</name>
                            <description>desc ZMSKPOS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZMSKVAL</name>
                            <description>desc ZMSKVAL</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICONR</name>
                    <description>desc ICONR</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF01FF</resetMask>
                    <fields>
                        <field>
                            <name>INTENA</name>
                            <description>desc INTENA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENB</name>
                            <description>desc INTENB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENC</name>
                            <description>desc INTENC</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEND</name>
                            <description>desc INTEND</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENE</name>
                            <description>desc INTENE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENF</name>
                            <description>desc INTENF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENOVF</name>
                            <description>desc INTENOVF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENUDF</name>
                            <description>desc INTENUDF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENDTE</name>
                            <description>desc INTENDTE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENSAU</name>
                            <description>desc INTENSAU</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENSAD</name>
                            <description>desc INTENSAD</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENSBU</name>
                            <description>desc INTENSBU</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENSBD</name>
                            <description>desc INTENSBD</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
